app/controllers/apps_controller.rb

SELECT "apps".* FROM "apps" WHERE "apps"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @app = App.find(params[:id])